In [3]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
#in series
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
#data.dropna(inplace = True)

In [14]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [15]:
data.fillna(0)

0    1.0
1    0.0
2    3.5
3    0.0
4    7.0
dtype: float64

In [16]:
#in frame

In [17]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data.fillna({0:2,1:0,2:1})#in column

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  1.0
2  2.0  0.0  1.0
3  2.0  6.5  3.0

In [20]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
#data.dropna(how = "all")
#it will drop only which has all NAN

In [22]:
data[4] = NA

In [23]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [24]:
data.dropna(how = "all" , axis = 1) #it will drop column if all the column has NAn value

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data.dropna(thresh = 1) #thresh equals 1 means it will not drop any value if it has even 1 value

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
df = pd.DataFrame(np.random.randn(7,3))

In [27]:
df.iloc[:4,1]= NA
df.iloc[:2,2]=NA

In [28]:
df

          0         1         2
0 -0.299941       NaN       NaN
1 -1.127190       NaN       NaN
2  1.232341       NaN -0.560557
3  1.510646       NaN  0.838056
4 -1.723748 -0.128269 -1.105812
5  2.414493  0.164937  1.942531
6  0.144141 -0.597273  0.854649

In [29]:
df.dropna(thresh = 1)

          0         1         2
0 -0.299941       NaN       NaN
1 -1.127190       NaN       NaN
2  1.232341       NaN -0.560557
3  1.510646       NaN  0.838056
4 -1.723748 -0.128269 -1.105812
5  2.414493  0.164937  1.942531
6  0.144141 -0.597273  0.854649

In [30]:
df.fillna({1 : 5,2:9})

          0         1         2
0 -0.299941  5.000000  9.000000
1 -1.127190  5.000000  9.000000
2  1.232341  5.000000 -0.560557
3  1.510646  5.000000  0.838056
4 -1.723748 -0.128269 -1.105812
5  2.414493  0.164937  1.942531
6  0.144141 -0.597273  0.854649

In [31]:
#df.fillna(method = "ffill"})   #forword fill to NaN and it will put last value from NaN
#df.fillna(method = "bfill")    #backword fill to NaN

In [32]:
df.fillna(df.mean())

          0         1         2
0 -0.299941 -0.186869  0.393774
1 -1.127190 -0.186869  0.393774
2  1.232341 -0.186869 -0.560557
3  1.510646 -0.186869  0.838056
4 -1.723748 -0.128269 -1.105812
5  2.414493  0.164937  1.942531
6  0.144141 -0.597273  0.854649

In [34]:
data1 = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [36]:
data1

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [37]:
data.duplicated() #it will show the duplicste value by True

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data[data.duplicated()] #it will directly show complete value i.e complete raw and column

    k1  k2
6  two   4

In [43]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [45]:
#data.drop_duplicates(['k1'])

In [46]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [47]:
data.drop_duplicates(['k1', 'k2'], keep='last') #

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [48]:
data["v1"] = range(7)

In [49]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [50]:
data2 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [51]:
data2

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [61]:
meat_to_animal = {
'bacon': 'goat',
'pulled pork': 'goat',
'pastrami': 'goat',
'corned beef': 'cow',
'honey ham': 'goat',
'nova lox': 'salmon'}

In [62]:
meat_to_animal

{'bacon': 'goat',
 'pulled pork': 'goat',
 'pastrami': 'goat',
 'corned beef': 'cow',
 'honey ham': 'goat',
 'nova lox': 'salmon'}

In [63]:
lowercased = data2['food'].str.lower()

In [64]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [65]:
data2['animal'] = lowercased.map(meat_to_animal)

In [66]:
data2

          food  ounces  animal
0        bacon     4.0    goat
1  pulled pork     3.0    goat
2        bacon    12.0    goat
3     Pastrami     6.0    goat
4  corned beef     7.5     cow
5        Bacon     8.0    goat
6     pastrami     3.0    goat
7    honey ham     5.0    goat
8     nova lox     6.0  salmon

In [68]:
data2['food'].map(lambda x: meat_to_animal[x.lower()])

0      goat
1      goat
2      goat
3      goat
4       cow
5      goat
6      goat
7      goat
8    salmon
Name: food, dtype: object

In [70]:
data3 = pd.Series([1., -999., 2., -999., -1000., 3.])

In [71]:
data3

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [73]:
data3.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [75]:
data3.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [77]:
data3.replace([-999, -1000], np.nan),[4,5]

(0    1.0
 1    NaN
 2    2.0
 3    NaN
 4    NaN
 5    3.0
 dtype: float64, [4, 5])

In [79]:
data4 = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])

In [80]:
data4

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [82]:
data4.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [85]:
data4.rename(index = {"Ohio" : "Karachi"}, columns = {"three" : "Peshawar"})

          one  two  Peshawar  four
Karachi     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [86]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [87]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [88]:
bins = [18, 25, 35, 60, 100]

In [89]:
bins

[18, 25, 35, 60, 100]

In [90]:
cats = pd.cut(ages, bins)

In [91]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [92]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

# HIERACHINAL INDEXING

In [95]:
data5 = pd.Series(np.random.randn(9),index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [120]:
data5

a  1    0.618926
   2   -0.666579
   3    0.042551
b  1    0.724754
   3   -1.604699
c  1    0.285613
   2    0.885667
d  2   -1.420237
   3   -0.916778
dtype: float64

In [104]:
data5[2]#it returned 3rd value from "a" by default

0.04255144337115883

In [99]:
data5["a"]

1    0.618926
2   -0.666579
3    0.042551
dtype: float64

In [106]:
data5["a",1]

0.6189257310189318

In [107]:
data5["a"][1]

0.6189257310189318

In [114]:
data5['b':'c']

b  1    0.724754
   3   -1.604699
c  1    0.285613
   2    0.885667
dtype: float64

In [122]:
#data5.loc[['b':'c']]

In [124]:
data5.unstack()

          1         2         3
a  0.618926 -0.666579  0.042551
b  0.724754       NaN -1.604699
c  0.285613  0.885667       NaN
d       NaN -1.420237 -0.916778

In [126]:
data5.unstack().stack()

a  1    0.618926
   2   -0.666579
   3    0.042551
b  1    0.724754
   3   -1.604699
c  1    0.285613
   2    0.885667
d  2   -1.420237
   3   -0.916778
dtype: float64

In [127]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [128]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [129]:
frame.index.names = ['key1', 'key2']

In [130]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [131]:
frame.columns.names = ['state', 'color']

In [132]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [133]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [135]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

# REORDERING AND SORTING LEVELS

In [136]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [137]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [138]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

# Summary Statistics by Level

In [139]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [140]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10